Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim7.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32L4R5_tim7.
; ===============

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32L4R5_tim7 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// TIM7 address definitions
// ------------------------

typedef struct {
    volatile    uint16_t    CR1;
    volatile    uint16_t    RESERVED0;
    volatile    uint16_t    CR2;
    volatile    uint16_t    RESERVED1[3];
    volatile    uint16_t    DIER;
    volatile    uint16_t    RESERVED2;
    volatile    uint16_t    SR;
    volatile    uint16_t    RESERVED3;
    volatile    uint16_t    EGR;
    volatile    uint16_t    RESERVED4[7];
    volatile    uint32_t    CNT;
    volatile    uint16_t    PSC;
    volatile    uint16_t    RESERVED5;
    volatile    uint16_t    ARR;
} TIM7_TypeDef;

#ifdef __cplusplus
#define TIM7    reinterpret_cast<TIM7_TypeDef *>(0x40001400U)

#else
#define TIM7    ((TIM7_TypeDef *)0x40001400U)
#endif

// CR1 Configuration

#define TIM7_CR1_UIFREMAP       (0x1U<<11)
#define TIM7_CR1_ARPE           (0x1U<<7)
#define TIM7_CR1_OPM            (0x1U<<3)
#define TIM7_CR1_URS            (0x1U<<2)
#define TIM7_CR1_UDIS           (0x1U<<1)
#define TIM7_CR1_CEN            (0x1U<<0)
#define TIM7_CR1_UIFREMAP_B_0X0 (0x0U<<11)
#define TIM7_CR1_UIFREMAP_B_0X1 (0x1U<<11)
#define TIM7_CR1_ARPE_B_0X0     (0x0U<<7)
#define TIM7_CR1_ARPE_B_0X1     (0x1U<<7)
#define TIM7_CR1_OPM_B_0X0      (0x0U<<3)
#define TIM7_CR1_OPM_B_0X1      (0x1U<<3)
#define TIM7_CR1_URS_B_0X0      (0x0U<<2)
#define TIM7_CR1_URS_B_0X1      (0x1U<<2)
#define TIM7_CR1_UDIS_B_0X0     (0x0U<<1)
#define TIM7_CR1_UDIS_B_0X1     (0x1U<<1)
#define TIM7_CR1_CEN_B_0X0      (0x0U<<0)
#define TIM7_CR1_CEN_B_0X1      (0x1U<<0)

// CR2 Configuration

#define TIM7_CR2_MMS            (0x7U<<4)
#define TIM7_CR2_MMS_0          (0x1U<<4)
#define TIM7_CR2_MMS_B_0X0      (0x0U<<4)
#define TIM7_CR2_MMS_B_0X1      (0x1U<<4)
#define TIM7_CR2_MMS_B_0X2      (0x2U<<4)

// DIER Configuration

#define TIM7_DIER_UDE           (0x1U<<8)
#define TIM7_DIER_UIE           (0x1U<<0)
#define TIM7_DIER_UDE_B_0X0     (0x0U<<8)
#define TIM7_DIER_UDE_B_0X1     (0x1U<<8)
#define TIM7_DIER_UIE_B_0X0     (0x0U<<0)
#define TIM7_DIER_UIE_B_0X1     (0x1U<<0)

// SR Configuration

#define TIM7_SR_UIF             (0x1U<<0)
#define TIM7_SR_UIF_B_0X0       (0x0U<<0)
#define TIM7_SR_UIF_B_0X1       (0x1U<<0)

// EGR Configuration

#define TIM7_EGR_UG             (0x1U<<0)
#define TIM7_EGR_UG_B_0X0       (0x0U<<0)
#define TIM7_EGR_UG_B_0X1       (0x1U<<0)

// CNT Configuration

#define TIM7_CNT_UIFCPY         (0x1U<<31)
#define TIM7_CNT_CNT            (0xFFFFU<<0)
#define TIM7_CNT_CNT_0          (0x1U<<0)

// PSC Configuration

#define TIM7_PSC_PSC            (0xFFFFU<<0)
#define TIM7_PSC_PSC_0          (0x1U<<0)

// ARR Configuration

#define TIM7_ARR_ARR            (0xFFFFU<<0)
#define TIM7_ARR_ARR_0          (0x1U<<0)
